[
  {
    "id": 1,
    "title": "Wiredmind2",
    "description": "A collection of Python scripts and projects created by CS student William Michaud.",
    "longDescription": "WiredMind2 is a Python library designed to provide efficient algorithmic solutions and reusable components for competitive programming challenges. It offers a set of optimized tools and data structures aimed at simplifying complex problem-solving tasks, making it an essential resource for developers preparing for contests like the ICPC.",
    "techStack": [
      "Python",
      "Algorithm",
      "Competitive Programming",
      "Python Scripting",
      "GitHub Profile"
    ],
    "image": "/projects/wiredmind2.jpg",
    "githubUrl": "https://github.com/WiredMind2/WiredMind2",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 2,
    "title": "Invertedpendulum",
    "description": "This Python project simulates an inverted pendulum (CartPole), uses a Reinforcement Learning agent to balance it, and provides a web-based UI for real-time visualization.",
    "longDescription": "A Python project that simulates an inverted pendulum (CartPole) and utilizes Reinforcement Learning, specifically the PPO algorithm from Stable Baselines3, to train an agent to balance it. The application features a real-time, web-based visualization built with FastAPI and WebSockets, allowing users to observe the trained model's performance in their browser. It includes scripts for training the model and serving the interactive simulation UI.",
    "techStack": [
      "Python",
      "Reinforcement Learning",
      "FastAPI",
      "WebSockets",
      "Stable Baselines3"
    ],
    "image": "/projects/invertedpendulum.jpg",
    "githubUrl": "https://github.com/WiredMind2/InvertedPendulum",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 3,
    "title": "Forcedirectedgraphs",
    "description": "A high-performance Python library for visualizing large graphs using force-directed layout algorithms with multiprocessing and Deep Zoom Image output.",
    "longDescription": "This repository provides a high-performance Python tool for visualizing large-scale graphs using force-directed layout algorithms. It leverages multiprocessing and shared memory for efficient computation, using SQLite to manage memory usage effectively. The final output is rendered as a Deep Zoom Image (DZI), enabling interactive exploration of massive graphs through a local web server.",
    "techStack": [
      "Python",
      "NumPy",
      "SQLite",
      "Multiprocessing",
      "Deep Zoom"
    ],
    "image": "/projects/forcedirectedgraphs.jpg",
    "githubUrl": "https://github.com/WiredMind2/ForceDirectedGraphs",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 4,
    "title": "Projet Alia",
    "description": "A Prolog implementation of the Connect Four game for the ALIA project, complete with an AI tournament configuration and automated tests.",
    "longDescription": "This GitHub repository contains the source code for the Prolog implementation of the ALIA project, specifically a strategic \"Puissance 4\" (Connect Four) game engine. It features a complete game environment allowing human players to start matches via the `start.` predicate, alongside a robust testing suite for verifying logic and AI configurations. Additionally, the repository supports automated tournament setups, enabling users to define and test various AI agents with specific parameters through the `tournament_config.pl` file.",
    "techStack": [
      "Prolog",
      "AI",
      "Game Engine",
      "Tournament"
    ],
    "image": "/projects/projetalia.jpg",
    "githubUrl": "https://github.com/WiredMind2/Projet-ALIA",
    "featured": false,
    "category": "other"
  },
  {
    "id": 5,
    "title": "Backtesting",
    "description": "A comprehensive, production-ready Python system for algorithmic trading backtesting with sentiment analysis and machine learning.",
    "longDescription": "A production-ready algorithmic trading backtesting system featuring news-based sentiment analysis, multi-horizon LightGBM predictive models, and intraday backtesting with realistic slippage and commission modeling. The repository includes interactive OHLCV charts with AI prediction overlays, confidence bands, and real-time monitoring capabilities for 1, 3, and 7-day trading horizons.",
    "techStack": [
      "Python",
      "Machine Learning",
      "Trading",
      "Backtesting",
      "LightGBM"
    ],
    "image": "/projects/backtesting.jpg",
    "githubUrl": "https://github.com/WiredMind2/backtesting",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 6,
    "title": "Awale Game",
    "description": "A modular C implementation of the Awale game featuring a clean client/server architecture with unit-testable logic and single-socket communication.",
    "longDescription": "Awale-Game is a modular C implementation of the traditional Awale (Oware/Mancala) game, designed with a strict separation between the pure game logic and networking layers to facilitate unit testing and maintainability. The project features a client/server architecture that uses UDP broadcasts for automatic server discovery on the local network, followed by a simplified single-socket TCP connection for gameplay communication. It supports cross-platform compilation for Linux, macOS, and Windows, includes thread-safe handling for concurrent games, and offers a text-based client interface with internationalization support for both English and French.",
    "techStack": [
      "C",
      "Networking",
      "Game-Development",
      "UDP",
      "TCP"
    ],
    "image": "/projects/awalegame.jpg",
    "githubUrl": "https://github.com/WiredMind2/Awale-Game",
    "featured": false,
    "category": "other"
  },
  {
    "id": 7,
    "title": "Openrouterclient",
    "description": "A Python CLI tool that connects to OpenRouter's OpenAI-compatible API to run chat completions.",
    "longDescription": "A minimal Python CLI client for interacting with OpenAI-compatible chat completion endpoints through OpenRouter. Key features include simple .env configuration management, command-line argument parsing for API keys and models, and support for custom endpoints and optional ranking headers (referer and X-Title). It is designed to be a lightweight, synchronous tool for quick API testing without external dependencies.",
    "techStack": [
      "Python",
      "CLI",
      "OpenAI API",
      "Dotenv"
    ],
    "image": "/projects/openrouterclient.jpg",
    "githubUrl": "https://github.com/WiredMind2/OpenRouterClient",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 8,
    "title": "Pld Agile",
    "description": "A Python FastAPI backend for the PLD-AGILE project, designed for scalability.",
    "longDescription": "PLD-AGILE is a full-stack web application built with a modular Python FastAPI backend and a modern Node.js frontend. It provides a scalable architecture designed for easy extensibility, featuring a RESTful API with interactive documentation and a responsive user interface. The repository includes complete setup guides for both the API server and the client-side application to streamline development and deployment.",
    "techStack": [
      "Python",
      "FastAPI",
      "Node.js",
      "React"
    ],
    "image": "/projects/pldagile.jpg",
    "githubUrl": "https://github.com/WiredMind2/PLD-AGILE",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 9,
    "title": "Gymtracker",
    "description": "A modern workout tracking app built with React, Tailwind CSS, and Chart.js for monitoring progress and managing exercises.",
    "longDescription": "A modern, responsive workout tracking application built with React and Tailwind CSS to help you track workouts and monitor progress with real charts. It features customizable templates, a pre-loaded exercise library with over 45 exercises, and smart workout tracking to manage sets, reps, and weights. The app includes advanced analytics for progress visualization, dark mode support, data export/import for backups, and is fully optimized for mobile and PWA installation.",
    "techStack": [
      "React",
      "JavaScript",
      "Tailwind CSS",
      "Vite",
      "Chart.js"
    ],
    "image": "/projects/gymtracker.jpg",
    "githubUrl": "https://github.com/WiredMind2/GymTracker",
    "featured": false,
    "category": "web"
  },
  {
    "id": 10,
    "title": "Animemanager",
    "description": "AnimeManager is a Python application that handles anime discovery from multiple databases, torrent searching, automatic downloads via Qbittorent, and provides built-in media playback.",
    "longDescription": "AnimeManager is a comprehensive Python application that automates the entire anime watching process, from discovery to playback. It allows users to search thousands of titles across multiple database websites and find available torrents with a single click. Featuring automatic download management via Qbittorrent and directory organization, the app also includes three built-in media players for an immediate, seamless viewing experience.",
    "techStack": [
      "Python",
      "PyQt",
      "Web Scraping",
      "Torrent",
      "Media Player"
    ],
    "image": "/projects/animemanager.jpg",
    "githubUrl": "https://github.com/WiredMind2/AnimeManager",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 11,
    "title": "Manga Reader",
    "description": "A responsive web application for reading manga from local archives (ZIP, RAR, CBZ, CBR) with user authentication and progress tracking, built with a FastAPI backend and SvelteKit frontend.",
    "longDescription": "A modern manga reader web application built with a Python FastAPI backend and SvelteKit frontend, designed to browse and read manga from local archives or folders. It supports multi-format archives (ZIP, RAR, CBZ, CBR), features server-side image optimization, and includes user authentication with personal reading progress tracking. The application offers a fully responsive interface with right-to-left (manga) and top-to-bottom (manhwa) reading modes.",
    "techStack": [
      "FastAPI",
      "Svelte",
      "Python",
      "TypeScript",
      "Docker"
    ],
    "image": "/projects/mangareader.jpg",
    "githubUrl": "https://github.com/WiredMind2/Manga-Reader",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 12,
    "title": "Custom_Agent",
    "description": "A Python-based AI agent with interactive CLI and web API that connects to LLMs like Ollama and integrates MCP servers for extended functionality.",
    "longDescription": "A Python-based AI agent that connects to multiple LLM providers including Ollama, OpenAI, Anthropic, and GitHub Copilot CLI. It integrates with MCP servers for extended tool functionality and offers both an interactive CLI and FastAPI-based REST API for versatile usage. Features include streaming responses, automatic tool calling, persistent conversation management, and real-time provider switching.",
    "techStack": [
      "Python",
      "FastAPI",
      "Ollama",
      "Model Context Protocol (MCP)",
      "LLM Integration"
    ],
    "image": "/projects/custom_agent.jpg",
    "githubUrl": "https://github.com/WiredMind2/custom_agent",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 13,
    "title": "Airwatcher",
    "description": "AirWatcher is a C++ application for collecting and analyzing air quality data to help users monitor environmental pollution.",
    "longDescription": "A C++ application designed to monitor and analyze air quality by collecting and processing atmospheric pollution data. The software offers features for data analysis, such as estimating air quality at specific coordinates, identifying unreliable sensors, and assessing the impact of purifiers. It provides detailed statistics, including average air quality per zone, and supports multiple user profiles like government agencies, individuals, and providers.",
    "techStack": [
      "C++",
      "CMake",
      "Data Analysis",
      "CSV",
      "Algorithms"
    ],
    "image": "/projects/airwatcher.jpg",
    "githubUrl": "https://github.com/WiredMind2/AirWatcher",
    "featured": false,
    "category": "other"
  },
  {
    "id": 18,
    "title": "Chess2",
    "description": "A C++ implementation of a three-player chess game on a hexagonal board, featuring an AI capable of managing complex multi-player interactions and unique geometric challenges.",
    "longDescription": "A C++ implementation of a three-player chess variant on a 96-cell hexagonal board. This strategic game features classical chess rules adapted for three factions (White, Black, and Red), introducing complex geopolitical dynamics where players must avoid piece exchanges that benefit the third competitor. It includes an advanced Artificial Intelligence designed to handle multi-directional threats and the unique geometry of the hexagonal grid.",
    "techStack": [
      "C++",
      "Game Development",
      "Artificial Intelligence",
      "Hexagonal Grid",
      "Chess Engine"
    ],
    "image": "/projects/chess2.jpg",
    "githubUrl": "https://github.com/WiredMind2/Chess2",
    "featured": false,
    "category": "other"
  },
  {
    "id": 19,
    "title": "Helium",
    "description": "A modular Python Discord bot providing AI chat, image generation, moderation, leveling, and social roleplay features via plugins.",
    "longDescription": "Helium: A modular, multi-purpose Discord bot.\n \n Written in Python with Pycord, Helium utilizes a dynamic plugin system\n to deliver AI chat, DALL-E image generation, and robust moderation.\n Features include an XP leveling system and social roleplay tools\n to enhance community engagement.",
    "techStack": [
      "CSS",
      "Python",
      "Discord API",
      "Groq",
      "OpenAI",
      "DALL-E"
    ],
    "image": "/projects/helium.jpg",
    "githubUrl": "https://github.com/WiredMind2/Helium",
    "featured": true,
    "category": "web"
  },
  {
    "id": 21,
    "title": "Flashcards",
    "description": "A Next.js application written in TypeScript for creating and managing flashcards.",
    "longDescription": "A Next.js flashcard application built with TypeScript for efficient learning and memorization. The project leverages modern React features and provides a foundation for creating, managing, and reviewing study decks. It includes a development environment configured with hot reloading and optimized fonts for a responsive user interface.",
    "techStack": [
      "TypeScript",
      "Next.js",
      "React"
    ],
    "image": "/projects/flashcards.jpg",
    "githubUrl": "https://github.com/WiredMind2/flashcards",
    "featured": false,
    "category": "web"
  },
  {
    "id": 22,
    "title": "Register 1",
    "description": "English: Secure a free, developer-friendly .is-a.dev subdomain for your project.\n\nFrench: Obtenez un sous-domaine .is-a.dev gratuit et adapté aux développeurs pour votre projet.\n\nGerman: Sichern Sie sich eine kostenlose, entwicklerfreundliche .is-a.dev-Subdomain für Ihr Projekt.\n\nSpanish: Asegura un subdominio .is-a.dev gratuito y orientado a desarrolladores para tu proyecto.\n\nPortuguese: Garanta um subdomínio .is-a.dev gratuito e amigável para desenvolvedores para o seu projeto.\n\nItaliano: Ottieni un sottodominio .is-a.dev gratuito e pensato per gli sviluppatori per il tuo progetto.\n\nRussian: Получите бесплатный поддомен .is-a.dev, удобный для разработчиков, для вашего проекта.\n\nJapanese: 開発者向けの無料サブドメイン .is-a.dev をプロジェクト用に確保しましょう。\n\nChinese (Simplified): 为您的项目获取一个免费且开发者友好的 .is-a.dev 子域名。\n\nKorean: 개발자 친화적인 무료 .is-a.dev 하위 도메인을 프로젝트에 등록하세요.",
    "longDescription": "English:\nis-a.dev is a service that allows developers to easily register a free \".is-a.dev\" subdomain for their personal websites or projects. It features a manual registration process where you can fork the repository and add a JSON file, as well as a convenient CLI tool. Once your pull request is approved and merged, you can enjoy your new custom domain.\n\nDeutsch:\nis-a.dev ist ein Service, der es Entwicklern ermöglicht, kostenlos eine \".is-a.dev\"-Subdomain für ihre persönlichen Webseiten oder Projekte zu registrieren. Es bietet einen manuellen Registrierungsprozess, bei dem du das Repository forken und eine JSON-Datei hinzufügst, sowie ein praktisches CLI-Tool. Sobald dein Pull-Request genehmigt und gemerged ist, kannst du deine neue benutzerdefinierte Domain genießen.\n\nFrançais:\nis-a.dev est un service qui permet aux développeurs de facilement enregistrer un sous-domaine \".is-a.dev\" gratuit pour leurs sites web personnels ou projets. Il propose un processus d'enregistrement manuel où vous pouvez forker le dépôt et ajouter un fichier JSON, ainsi qu'un outil CLI pratique. Une fois votre pull request approuvée et fusionnée, vous pouvez profiter de votre nouveau domaine personnalisé.\n\nEspañol:\nis-a.dev es un servicio que permite a los desarrolladores registrar fácilmente un subdominio \".is-a.dev\" gratuito para sus sitios web personales o proyectos. Cuenta con un proceso de registro manual donde puedes bifurcar el repositorio y añadir un archivo JSON, así como una herramienta CLI conveniente. Una vez que tu pull request sea aprobada y fusionada, podrás disfrutar de tu nuevo dominio personalizado.\n\nItaliano:\nis-a.dev è un servizio che permette agli sviluppatori di registrare facilmente un sottodominio \".is-a.dev\" gratuito per i loro siti web personali o progetti. Offre un processo di registrazione manuale in cui puoi fare il fork del repository e aggiungere un file JSON, così come un comodo strumento CLI. Una volta che la tua pull request verrà approvata e unita, potrai goderti il tuo nuovo dominio personalizzato.\n\nPortuguese:\nis-a.dev é um serviço que permite aos desenvolvedores registrar facilmente um subdomínio \".is-a.dev\" gratuito para seus sites pessoais ou projetos. Possui um processo de registro manual onde você pode fazer o fork do repositório e adicionar um arquivo JSON, além de uma ferramenta CLI conveniente. Uma vez que seu pull request for aprovado e mesclado, você pode desfrutar de seu novo domínio personalizado.\n\nRussian:\nis-a.dev — это сервис, который позволяет разработчикам легко регистрировать бесплатный поддомен \".is-a.dev\" для своих личных веб-сайтов или проектов. Он предлагает ручной процесс регистрации, где вы можете форкнуть репозиторий и добавить JSON-файл, а также удобный CLI-инструмент. После одобрения и слияния вашего pull request вы сможете наслаждаться своим новым кастомным доменом.\n\nJapanese:\nis-a.devは、開発者が個人のWebサイトやプロジェクト用に無料の「.is-a.dev」サブドメインを簡単に登録できるサービスです。リポジトリをフォークしてJSONファイルを追加する手動登録プロセスと、便利なCLIツールを備えています。プルリクエストが承認されマージされると、新しいカスタムドメインを使用できます。\n\nChinese:\nis-a.dev 是一项服务，允许开发者轻松注册免费的“.is-a.dev”子域名，用于他们的个人网站或项目。它提供手动注册流程，你可以 fork 仓库并添加 JSON 文件，以及便捷的 CLI 工具。一旦你的拉取请求被批准并合并，你就可以使用你的新自定义域名了。\n\nKorean:\nis-a.dev는 개발자가 개인 웹사이트나 프로젝트에 대해 무료 \".is-a.dev\" 하위 도메인을 쉽게 등록할 수 있는 서비스입니다. 저장소를 포크하고 JSON 파일을 추가하는 수동 등록 프로세스와 편리한 CLI 도구를 제공합니다. 풀 리퀘스트가 승인되고 병합되면 새로운 사용자 정의 도메인을 즐길 수 있습니다.",
    "techStack": [
      "Node.js",
      "JavaScript",
      "DNS",
      "JSON"
    ],
    "image": "/projects/register1.jpg",
    "githubUrl": "https://github.com/WiredMind2/register-1",
    "featured": false,
    "category": "other"
  }
]