[
  {
    "id": 1,
    "title": "Register",
    "description": "Grab your custom `.is-a.dev` subdomain with this JavaScript-based registration tool.",
    "longDescription": "The 'register' repository is a JavaScript-based service enabling developers to claim custom '.is-a.dev' subdomains for personal websites through a streamlined GitHub pull request process. Users fork the repository, configure their domain via Markdown files, and submit a PR for review—approval triggers automated DNS deployment. The project includes community-driven support, documentation, and real-time updates via Discord for seamless domain management.",
    "techStack": [
      "JavaScript"
    ],
    "image": "/projects/register.jpg",
    "githubUrl": "https://github.com/is-a-dev/register",
    "featured": false,
    "category": "web",
    "ignore": true
  },
  {
    "id": 2,
    "title": "Wiredmind2",
    "description": "Python-based AI and neural network development toolkit.",
    "longDescription": "WiredMind2 is a Python repository dedicated to competitive programming and algorithmic training, featuring optimized solutions, problem sets, and educational materials curated from competitions like ICPC, Prologin, and Match'Up. It provides reusable code templates, conference materials, and practice exercises developed for INSAlgo workshops, empowering developers to enhance their problem-solving skills. Designed by an experienced competitor, the repository emphasizes clean, efficient code with a focus on using tabs for indentation.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/wiredmind2.jpg",
    "githubUrl": "https://github.com/WiredMind2/WiredMind2",
    "featured": false,
    "category": "fullstack",
    "ignore": true
  },
  {
    "id": 4,
    "title": "Marmitonic",
    "description": "MarmiTonic is a Python-based semantic web application leveraging Linked Data (DBpedia), SPARQL, and graph analysis for intelligent cocktail discovery, personalized recommendations, and bar inventory optimization.",
    "longDescription": "MarmiTonic is a Python semantic web application for intelligent cocktail discovery and bar management, leveraging DBpedia's Linked Data, SPARQL queries, and graph analysis to provide personalized recommendations and ingredient optimization. It features smart inventory tracking, feasibility analysis for cocktails, and graph-based relationship visualization while offering advanced functionalities like custom SPARQL exploration and a \"Bar Minimum\" mode to maximize cocktail creation efficiency with minimal ingredients.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/marmitonic.jpg",
    "githubUrl": "https://github.com/MonacoTac/MarmiTonic",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 5,
    "title": "Battlecode26",
    "description": "Java scaffold for Battlecode 2026 with an example player to kickstart competition bot development.",
    "longDescription": "The Battlecode 2026 Java scaffold provides a foundational template for developing competitive AI bots in the Battlecode programming competition, featuring an expandable `examplefuncsplayer` implementation, Gradle-based build automation, and integrated client tools for testing matches. This repository streamlines bot development with tailored commands for compilation, match execution, submission packaging, and configuration management through `gradle.properties`. It includes structured directories for source code, tests, custom maps, match outputs, and compatibility options to ensure seamless participation in the tournament.",
    "techStack": [
      "Java"
    ],
    "image": "/projects/battlecode26.jpg",
    "githubUrl": "https://github.com/WiredMind2/battlecode26",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 6,
    "title": "Tetrazero",
    "description": "A modern, animated TypeScript portfolio built with Next.js, React, GSAP, and Tailwind CSS featuring smooth scroll animations, interactive particles, and dark/light mode.",
    "longDescription": "TetraZero is a modern professional portfolio website built with TypeScript, Next.js 14, React 18, and Tailwind CSS, featuring GSAP-powered animations and interactive particle effects. The site offers a dynamic user experience through smooth scroll transitions, theme toggling with localStorage persistence, responsive design, and SEO optimization. Key sections include project filtering, a functional contact form, and component-based architecture for maintainability.",
    "techStack": [
      "TypeScript"
    ],
    "image": "/projects/tetrazero.jpg",
    "githubUrl": "https://github.com/WiredMind2/tetrazero",
    "featured": false,
    "category": "web"
  },
  {
    "id": 7,
    "title": "Manga Reader",
    "description": "A responsive FastAPI/SvelteKit web application for reading manga/manhwa with multi-format archive support, user authentication, reading modes, and progress tracking.",
    "longDescription": "Manga-Reader is a Python-based FastAPI backend paired with a SvelteKit frontend that provides a full-featured platform for reading manga/manhwa with support for folders and archives (ZIP/RAR/CBZ/CBR). The application offers responsive multi-directional reading modes, user progress tracking, server-side image optimization, and multi-language OCR-based text translation directly on manga pages. It includes secure authentication, modern UI components, and customizable metadata management for organized digital library browsing.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/mangareader.jpg",
    "githubUrl": "https://github.com/WiredMind2/Manga-Reader",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 8,
    "title": "Helium",
    "description": "A modular Python Discord bot using Pycord for entertainment and chaos via AI chat, image generation, moderation, leveling, and roleplay plugins.",
    "longDescription": "Helium is a modular Discord bot built with Python and the Pycord library, designed to deliver fun and lighthearted chaos through a dynamic plugin system. It features AI-driven chat, image generation, moderation tools, leveling systems, and social roleplay elements, supporting both slash and prefix commands. With a flexible architecture, the bot balances utility and entertainment to enhance server interaction.",
    "techStack": [
      "CSS"
    ],
    "image": "/projects/helium.jpg",
    "githubUrl": "https://github.com/WiredMind2/Helium",
    "featured": true,
    "category": "web"
  },
  {
    "id": 9,
    "title": "Backtesting",
    "description": "A production-ready Python framework for backtesting algorithmic trading strategies enhanced with sentiment analysis and machine learning.",
    "longDescription": "A Python-based algorithmic trading backtesting system integrating news sentiment analysis and LightGBM machine learning models for multi-horizon price predictions. Features realistic intraday backtesting with slippage and commission modeling, alongside interactive OHLC charts, confidence bands, and aggregated prediction visualizations. Designed as a production-ready platform for developing and evaluating data-driven trading strategies.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/backtesting.jpg",
    "githubUrl": "https://github.com/WiredMind2/backtesting",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 10,
    "title": "Animemanager",
    "description": "AnimeManager is a Python app that streamlines anime discovery, torrent-based downloading with qBittorrent integration, and built-in media playback for seamless viewing.",
    "longDescription": "AnimeManager is a comprehensive Python application that streamlines anime discovery, torrent acquisition, and playback through an all-in-one interface. It aggregates content from multiple databases for rapid searches, automates torrent downloading via integrations like qBittorrent, organizes files into subfolders, and provides built-in media players for seamless viewing. The tool serves as a self-contained solution for accessing and managing anime content efficiently.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/animemanager.jpg",
    "githubUrl": "https://github.com/WiredMind2/AnimeManager",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 11,
    "title": "Chess2",
    "description": "A C++ implementation of three-player hexagonal chess featuring an adapted Stockfish AI.",
    "longDescription": "Chess2 is a C++ implementation of a three-player hexagonal chess game, inspired by George R. Dekle Sr.'s variant, featuring classic chess pieces tailored for multi-player dynamics and a hexagonal board with 96 cells. The project includes an adapted Stockfish AI engine to handle intricate interactions between players and the geometric complexities of the hexagonal grid, offering unique strategic challenges like double threats and resource imbalances. Players can choose between white, black, or red factions, leveraging traditional rules—castling, pawn advances, and promotions—within this innovative three-way competitive framework.",
    "techStack": [
      "C++"
    ],
    "image": "/projects/chess2.jpg",
    "githubUrl": "https://github.com/WiredMind2/Chess2",
    "featured": true,
    "category": "other"
  },
  {
    "id": 12,
    "title": "Invertedpendulum",
    "description": "A Python project implementing a Proximal Policy Optimization (PPO) reinforcement learning agent to balance a CartPole inverted pendulum, featuring real-time visualization via a Flask web interface.",
    "longDescription": "A Python-based Reinforcement Learning project leveraging Stable Baselines3's PPO algorithm to train an agent for balancing a CartPole inverted pendulum system. Features a FastAPI backend with WebSocket communication and an interactive web UI (HTML5 Canvas) for real-time simulation visualization of the trained model in action. Includes training scripts, model persistence, and a modular structure for easy extension to other RL environments.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/invertedpendulum.jpg",
    "githubUrl": "https://github.com/WiredMind2/InvertedPendulum",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 13,
    "title": "Forcedirectedgraphs",
    "description": "High-performance Python library for visualizing large graphs using force-directed algorithms with multiprocessing, shared memory, SQLite storage, and Deep Zoom Image output.",
    "longDescription": "ForceDirectedGraphs offers a high-performance Python implementation for visualizing large-scale graphs through optimized force-directed layout algorithms, utilizing multiprocessing, shared memory, and SQLite integration to efficiently handle complex data. It generates interactive Deep Zoom Image (DZI) visualizations with smooth zoom/pan capabilities and includes a built-in web server for local exploration of rendered graphs. The tool provides an end-to-end workflow—from data ingestion via edge-list parsers to layout computation and browser-based visualization—ideal for analyzing network structures at scale.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/forcedirectedgraphs.jpg",
    "githubUrl": "https://github.com/WiredMind2/ForceDirectedGraphs",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 14,
    "title": "Projet Alia",
    "description": "A Prolog-based Connect 4 implementation featuring customizable AI players and tournament support.",
    "longDescription": "Projet ALIA is a Prolog-based implementation of the Connect Four game (Puissance 4), featuring customizable AI opponents and tournament configurations for competitive gameplay. The repository includes comprehensive testing utilities and supports defining AI behaviors via parameterized modules in tournament settings through editable configuration files. It enables users to simulate AI-driven matches, validate game logic with automated tests, and analyze strategic interactions between multiple AI agents.",
    "techStack": [
      "Prolog"
    ],
    "image": "/projects/projetalia.jpg",
    "githubUrl": "https://github.com/WiredMind2/Projet-ALIA",
    "featured": false,
    "category": "other"
  },
  {
    "id": 15,
    "title": "Awale Game",
    "description": "A modular C implementation of the Awale game with separated client/server architecture for isolated game logic and networking components.",
    "longDescription": "Awale-Game is a modular C implementation of the traditional Awale (Oware/Mancala) board game, designed with a client/server architecture that cleanly separates game logic, networking, and UI components for maintainability and unit testing. Its features include single-socket TCP communication, automatic server discovery via UDP broadcasts, thread-safe concurrent gameplay, and compile-time internationalization support for English and French. The cross-platform implementation (Linux/macOS/Windows) provides a structured foundation with comprehensive automated testing across core modules: game rules, network serialization, server matchmaking, and text-based client interfaces.",
    "techStack": [
      "C"
    ],
    "image": "/projects/awalegame.jpg",
    "githubUrl": "https://github.com/WiredMind2/Awale-Game",
    "featured": false,
    "category": "other"
  },
  {
    "id": 16,
    "title": "Openrouterclient",
    "description": "A lightweight Python CLI for interacting with OpenRouter's OpenAI-compatible chat completions API.",
    "longDescription": "OpenRouterClient is a lightweight Python CLI tool designed to interact with OpenRouter's OpenAI-compatible chat completions API, offering a minimal setup for synchronous API requests. It supports easy configuration via `.env` files or direct CLI argument input for API keys, model selection, and optional headers like `referer` and `x-title` for OpenRouter rankings. The tool provides flexibility with custom endpoint overrides and environment file paths, prioritizing simplicity while encouraging users to implement additional production-grade features like retries and streaming.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/openrouterclient.jpg",
    "githubUrl": "https://github.com/WiredMind2/OpenRouterClient",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 17,
    "title": "Pld Agile",
    "description": "A modular and scalable FastAPI backend written in Python for the PLD AGILE project.",
    "longDescription": "PLD-AGILE is a full-stack web application featuring a modular FastAPI backend built for scalability and extensibility, paired with a modern frontend framework. The backend offers robust REST API endpoints with interactive documentation via Swagger and Redoc, while the frontend delivers an intuitive user interface for agile project management tasks. The repository includes clear setup instructions for both components, including virtual environment configuration and dependency management for streamlined development workflows.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/pldagile.jpg",
    "githubUrl": "https://github.com/WiredMind2/PLD-AGILE",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 18,
    "title": "Gymtracker",
    "description": "GymTracker is a React and Tailwind CSS workout tracking app featuring progress charts, exercise templates, and set tracking.",
    "longDescription": "GymTracker is a React-based workout management application featuring real-time progress charts with Chart.js, customizable templates, and an exercise library with 45+ pre-loaded exercises. Designed with Tailwind CSS, it supports dark mode, offers mobile-optimized responsive design, and includes PWA capabilities for offline use. The app allows data import/export and comes with GitHub Actions configured for automatic deployment to GitHub Pages.",
    "techStack": [
      "JavaScript"
    ],
    "image": "/projects/gymtracker.jpg",
    "githubUrl": "https://github.com/WiredMind2/GymTracker",
    "featured": false,
    "category": "web"
  },
  {
    "id": 19,
    "title": "Custom_Agent",
    "description": "A Python-based AI agent supporting multiple LLMs like Ollama and OpenAI via MCP server integration for extended functionality, featuring an interactive CLI and FastAPI web API.",
    "longDescription": "Custom Agent is a Python-based AI agent offering versatile interaction with multiple large language models (LLMs), including Ollama (default), OpenAI, Anthropic, and GitHub Copilot CLI, alongside integration with MCP servers for extended functionality. It features an interactive CLI and a FastAPI-based web API, supporting real-time streaming responses, automatic tool calling, persistent conversation management, and dynamic provider switching during interactions. The agent simplifies AI-powered workflows by enabling local or cloud-based LLM connectivity while maintaining flexibility and extensibility through modular tool integration.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/custom_agent.jpg",
    "githubUrl": "https://github.com/WiredMind2/custom_agent",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 20,
    "title": "Airwatcher",
    "description": "AirWatcher is a C++ application that collects, analyzes, and displays air quality data to help users monitor and manage atmospheric pollution.",
    "longDescription": "AirWatcher is a C++ application for monitoring and analyzing air quality data, enabling users to estimate pollution levels at specific locations, identify unreliable sensors, and evaluate purifier effectiveness. It offers statistical tools to assess air quality by zones or points, classify sensor similarities, and supports distinct user roles—government agencies, individuals, and providers—with tailored features like administration controls and environmental impact analysis. The application leverages spatial data analysis and customizable parameters to deliver actionable insights for pollution management.",
    "techStack": [
      "C++"
    ],
    "image": "/projects/airwatcher.jpg",
    "githubUrl": "https://github.com/WiredMind2/AirWatcher",
    "featured": false,
    "category": "other"
  },
  {
    "id": 26,
    "title": "Flashcards",
    "description": "A Next.js and TypeScript-based web application for creating and studying flashcards.",
    "longDescription": "Flashcards is a Next.js-based application built with TypeScript designed for creating and managing interactive study flashcards. Key features include dynamic flashcard sets, real-time editing with auto-updates, and optimized font loading via `next/font` for improved performance. The project offers seamless deployment through Vercel and provides an intuitive development experience with hot-reloading and straightforward file-based customization.",
    "techStack": [
      "TypeScript"
    ],
    "image": "/projects/flashcards.jpg",
    "githubUrl": "https://github.com/WiredMind2/flashcards",
    "featured": false,
    "category": "web"
  },
  {
    "id": 27,
    "title": "Register 1",
    "description": "English: Claim your own stylish '.is-a.dev' subdomain.  \nSpanish: Consigue tu propio subdominio '.is-a.dev' con aspecto atractivo.  \nFrench: Obtenez votre sous-domaine '.is-a.dev' élégant.  \nGerman: Sichere dir deine optisch ansprechende '.is-a.dev'-Subdomain.  \nJapanese: おしゃれな '.is-a.dev' サブドメインを取得しよう。  \nSimplified Chinese: 获取属于你的美观 '.is-a.dev' 子域名。  \nRussian: Завладей стильным субдоменом '.is-a.dev'.  \nPortuguese: Garanta seu próprio subdomínio '.is-a.dev' com visual atraente.  \nHindi: आप खुद का आकर्षक '.is-a.dev' उपडोमेन पा सकते हो।  \nTurkish: Kendine şık görünümlü bir '.is-a.dev' alt alan adı edin.",
    "longDescription": "**English:** Secure a custom '.is-a.dev' subdomain for your personal developer portfolio or project via manual registration (GitHub fork + pull request) or CLI tool. The repository handles domain management, includes documentation links, and provides real-time status monitoring through shields.io badges and uptime tracking.  \n\n**Español:** Obtén un subdominio personalizado '.is-a.dev' para tu portafolio o proyecto de desarrollo mediante registro manual (fork de GitHub + pull request) o una herramienta CLI. El repositorio gestiona dominios, incluye documentación y ofrece monitoreo en tiempo real con insignias de shields.io y seguimiento de disponibilidad.  \n\n**Français:** Obtenez un sous-domaine personnalisé '.is-a.dev' pour votre portfolio ou projet de développement via une inscription manuelle (fork GitHub + pull request) ou un outil CLI. Le dépôt gère les domaines, fournit une documentation et inclut un suivi en temps réel via des badges shields.io et une surveillance de disponibilité.  \n\n**Deutsch:** Sichere dir eine benutzerdefinierte '.is-a.dev'-Subdomain für dein Entwicklerportfolio oder -projekt durch manuelle Registrierung (GitHub-Fork + Pull-Request) oder ein CLI-Tool. Das Repository verwaltet Domains, bietet Dokumentation und Echtzeit-Überwachung mittels shields.io-Badges und Uptime-Tracking.  \n\n**日本語:** マニュアル登録（GitHubのフォークとプルリクエスト）またはCLIツールを利用して、個人の開発者ポートフォリオやプロジェクト用に「.is-a.dev」サブドメインを取得できます。リポジトリはドメイン管理、ドキュメント、shields.ioバッジと稼働状況モニタリングによるリアルタイムステータスを提供します。  \n\n**中文:** 通过手动注册（GitHub fork + pull request）或CLI工具为您的个人开发项目获取自定义“.is-a.dev”子域名。存储库提供域名管理、文档链接，并通过shields.io徽章和实时状态仪表板监控服务可用性。  \n\n**हिन्दी:** मैन्युअल पंजीकरण (GitHub fork + pull request) या CLI टूल के माध्यम से अपने व्यक्तिगत डेवलपर पोर्टफोलियो या परियोजना के लिए कस्टम '.is-a.dev' सबडोमेन प्राप्त करें। रिपॉजिटरी डोमेन प्रबंधन, डॉक्यूमेंटेशन और shields.io बैजेज तथा अपटाइम ट्रैकिंग के माध्यम से रियल-टाइम स्टेटस जानकारी प्रदान करती है।",
    "techStack": [
      "Various"
    ],
    "image": "/projects/register1.jpg",
    "githubUrl": "https://github.com/WiredMind2/register-1",
    "featured": false,
    "category": "other",
    "ignore": true
  }
]