[
  {
    "id": 1,
    "title": "Gym Tracker",
    "description": "\"A React and Tailwind CSS workout tracking app providing progress charts, template management, and exercise library features.\"",
    "longDescription": "GymTracker is a React-based workout tracking application featuring real-time progress visualization with Chart.js, workout logging, and template management. The app includes a pre-loaded exercise library with custom exercise creation, progress analytics, dark mode, and PWA functionality—all styled with responsive Tailwind CSS. Designed with a GitHub Actions deployment pipeline, it offers export/import capabilities and full mobile optimization for seamless fitness tracking.",
    "techStack": [
      "JavaScript"
    ],
    "image": "/projects/gymtracker.jpg",
    "githubUrl": "https://github.com/WiredMind2/GymTracker",
    "featured": false,
    "category": "web"
  },
  {
    "id": 2,
    "title": "Anime Manager",
    "description": "A Python application to search, manage, automatically download, and watch anime episodes with torrent integration, database aggregation, and media playback.",
    "longDescription": "AnimeManager is a comprehensive Python application designed to streamline the anime-watching process by integrating multiple anime database searches, torrent retrieval, and media playback into a single tool. It enables users to search across thousands of animes, download torrents directly via Qbittorrent with automated file organization, and watch content seamlessly using built-in media players. The app simplifies the end-to-end experience—from discovery to viewing—while offering customizable options for torrent clients and adaptable folder management.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/animemanager.jpg",
    "githubUrl": "https://github.com/WiredMind2/AnimeManager",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 3,
    "title": "Manga Reader",
    "description": "\"Manga-Reader is a Python-built FastAPI/SvelteKit web app for reading manga/manhwa from archives or folders with user accounts, progress tracking, and responsive RTL/TTB reading modes.\"",
    "longDescription": "A modern manga reader web application built with Python (FastAPI) and SvelteKit, offering comprehensive multi-format support for archives (CBZ, CBR, ZIP, RAR) and folder-based manga libraries. It features secure user authentication, progress tracking across devices, responsive reading modes (RTL manga and top-to-bottom manhwa), and server-side image optimization while preserving original files. The application provides a clean, customizable interface using ShadCN components and TailwindCSS, with optional metadata management for organized browsing.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/mangareader.jpg",
    "githubUrl": "https://github.com/WiredMind2/Manga-Reader",
    "featured": true,
    "category": "fullstack"
  },
  {
    "id": 4,
    "title": "TTS",
    "description": "A Python library for text-to-speech synthesis with support for multiple models and voice cloning.",
    "longDescription": "TTS is a Python-based text-to-speech synthesis library designed to convert written text into natural-sounding speech. It supports multiple voices, customizable speech parameters (such as pitch and speed), and various output formats (WAV, MP3) for integration into applications. The library offers a simple API for developers and includes pre-trained models for efficient deployment across different platforms.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/tts.jpg",
    "githubUrl": "https://github.com/WiredMind2/TTS",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 5,
    "title": "Image Processing Library",
    "description": "A Python library for image processing utilities.",
    "longDescription": "A Python-based toolkit for efficient image processing and manipulation, supporting common operations such as loading, saving, transforming, and applying filters to images in various formats. Key features include batch processing, format conversion (JPG, PNG, WEBP, etc.), resizing, cropping, color adjustments, and basic computer vision functions like edge detection. Designed for simplicity and extensibility, it enables developers to integrate image workflows into applications with minimal dependencies.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/image.jpg",
    "githubUrl": "https://github.com/WiredMind2/image",
    "featured": false,
    "category": "fullstack"
  },
  {
    "id": 6,
    "title": "Manga Manager",
    "description": "A Python tool for organizing, tracking, and managing personal manga collections digitally.",
    "longDescription": "Manga-Manager is a Python-based tool for organizing and tracking your digital manga collection, featuring automated metadata retrieval, reading progress tracking, and file management. It supports batch processing for bulk imports, customizable shelving systems, and integration with popular manga databases to keep your library synchronized and easily searchable.",
    "techStack": [
      "Python"
    ],
    "image": "/projects/mangamanager.jpg",
    "githubUrl": "https://github.com/WiredMind2/Manga-Manager",
    "featured": false,
    "category": "fullstack"
  }
]